# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# Mac Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## System
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Shell Utilities
# ------------------------------------------------------------------------------
brew 'coreutils'
brew 'findutils'
brew 'jq'
brew 'q'
brew 'ack'
brew 'the_silver_searcher'
brew 'speedtest-cli'

# ------------------------------------------------------------------------------
## Network Utilities
# ------------------------------------------------------------------------------
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

# ------------------------------------------------------------------------------
# Editors
# ------------------------------------------------------------------------------
cask 'visual-studio-code'

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask 'sourcetree'
cask 'jetbrains-toolbox'
cask 'postman'

# ------------------------------------------------------------------------------
## Database
# ------------------------------------------------------------------------------
# brew 'postgresql'

# ------------------------------------------------------------------------------
## Containers
# ------------------------------------------------------------------------------
# brew 'docker-compose'
# cask 'docker'

# ------------------------------------------------------------------------------
## Virtualization
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# Media & Content Creation Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Dev Utilities
# ------------------------------------------------------------------------------
brew 'diff-so-fancy'
brew 'reattach-to-user-namespace'
brew 'git'
brew 'git-lfs'
brew 'imagemagick'
brew 'openssl'

# ------------------------------------------------------------------------------
## SDKs
# ------------------------------------------------------------------------------
brew 'node'
brew 'yarn'
brew 'python'
cask 'temurin'