# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# Mac Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## System
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Shell Utilities
# ------------------------------------------------------------------------------
brew 'tree'
brew 'trash'
brew 'terminal-notifier'

# ------------------------------------------------------------------------------
## Network Utilities
# ------------------------------------------------------------------------------
brew 'wget'

# ------------------------------------------------------------------------------
# Editors
# ------------------------------------------------------------------------------
cask 'visual-studio-code'

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask 'jetbrains-toolbox'

# ------------------------------------------------------------------------------
## Database
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Containers
# ------------------------------------------------------------------------------
brew 'docker'

# ------------------------------------------------------------------------------
## Virtualization
# ------------------------------------------------------------------------------
cask 'vmware-fusion'

# ------------------------------------------------------------------------------
# Media & Content Creation Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Dev Utilities
# ------------------------------------------------------------------------------
brew 'imagemagick'

# ------------------------------------------------------------------------------
## SDK Managers
# ------------------------------------------------------------------------------
brew 'nvm'
brew 'pyenv'
brew 'jenv'

# ------------------------------------------------------------------------------
## SDKs
# ------------------------------------------------------------------------------
brew 'go'

# ------------------------------------------------------------------------------
## Package Managers
# ------------------------------------------------------------------------------
brew 'pnpm'
brew 'yarn'
