# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'romkatv/powerlevel10k'

# ------------------------------------------------------------------------------
# Essential Apps
# ------------------------------------------------------------------------------
cask 'visual-studio-code'
cask 'bartender'

# ------------------------------------------------------------------------------
# Mac Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Productivity
# ------------------------------------------------------------------------------
cask 'google-chrome'
cask 'adobe-acrobat-reader'

# ------------------------------------------------------------------------------
## Communication
# ------------------------------------------------------------------------------
cask 'zoom'

# ------------------------------------------------------------------------------
## System
# ------------------------------------------------------------------------------
cask 'the-unarchiver'
cask 'iterm2'

# ------------------------------------------------------------------------------
## Media Apps
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
## Shell Utilities
# ------------------------------------------------------------------------------
brew 'zsh'
brew 'autojump'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-navigation-tools'
brew 'romkatv/powerlevel10k/powerlevel10k'

# ------------------------------------------------------------------------------
## System Utilities
# ------------------------------------------------------------------------------
brew 'terminal-notifier'
brew 'tree'
brew 'trash'
brew 'mackup'
brew 'folderify'
brew 'syncthing'